## In previous notebook, we have learn about fillna, idxmax, idxmin, merge, concat, plot functions
### In this notebook, we will learn about groupby, agg, pivot_table, melt, stack, unstack, crosstab.

In [1]:
import pandas as pd
df = pd.read_csv("Section_B.csv")

In [2]:
df

     id      Name  Gender  Age  Science  English  History  Maths  Total
0     2    Lemmie    Male   15       29       41       17     40    127
1     4     Denna  Female   14       15       53       82     33    183
2     7   Ichabod  Female   14       38       74       54     60    226
3     8  Beverlie    Male   14       25       51       41     80    197
4    12   Valaria    Male   13       19        5       78     76    178
..  ...       ...     ...  ...      ...      ...      ...    ...    ...
74  243    Morrie  Female   13       17       24       41     21    103
75  247       Rog  Female   13        1        4       68     65    138
76  248      Kaia    Male   15       93       48       82     44    267
77  249      Anni  Female   14       35       73       66     59    233
78  250  Fernande    Male   15       50        8       80     78    216

[79 rows x 9 columns]

# Groupby and Aggregate Functions
- **Groupby**: Splitting a dataframe into groups based on some criteria
- **Aggregate**: Computing some statistics (or aggregations) about each group

Here, we can see in the section_B data, we can make few groups of the data. We can make 3 groups of the data. Such as groupby Gender, Age or mark obtain by students in specific subject.

In [3]:
# groupby Gender and count the number of rows in each group
groupby_gender = df.groupby("Gender")
groupby_gender.size()

Gender
Female    47
Male      32
dtype: int64

In [4]:
# Create a DataFrame containing data only for the selected gender
Female_gender_df = groupby_gender.get_group("Female")
Male_gender_df = groupby_gender.get_group("Male")

In [5]:
Male_gender_df.head()

    id      Name Gender  Age  Science  English  History  Maths  Total
0    2    Lemmie   Male   15       29       41       17     40    127
3    8  Beverlie   Male   14       25       51       41     80    197
4   12   Valaria   Male   13       19        5       78     76    178
9   20    Ashlan   Male   13       41        6       17      3     67
10  22   Benoite   Male   14        3       55       14     95    167

In [6]:
Female_gender_df.head()

   id     Name  Gender  Age  Science  English  History  Maths  Total
1   4    Denna  Female   14       15       53       82     33    183
2   7  Ichabod  Female   14       38       74       54     60    226
5  14   Gracie  Female   13       93       38       39     98    268
6  15    Missy  Female   13       98       18       84     74    274
7  18     Dory  Female   13        5       89       25     23    142

In [7]:
# groupby Age and count the number of rows in each group
groupby_age = df.groupby("Age").size()
groupby_age

Age
13    32
14    23
15    24
dtype: int64

## Usage of Aggregation Functions in Pandas

The `agg()` function in Pandas is used to apply custom operations to different columns of a dataframe. This function is useful for performing complex calculations on your data in a single step. For example, you can use `agg()` to calculate the sum of one column, the mean of another column, and the count of a third column, all at the same time. 

We can also use `agg()` function with lambda functions to apply custom operations to our data. This can be useful when we want to perform some operation that is not available in the built-in functions of Pandas. 

Overall, `agg()` function is a powerful tool that can help us to perform complex calculations on our data with ease.

In [8]:
# using  agg function to apply diffrent operation on diffrent columns
df.agg({'Total': "mean", 'Maths': "sum", 'History': "max", 'English': "min"})

Total       210.341772
Maths      4396.000000
History      99.000000
English       2.000000
dtype: float64

## Finding the Mean of Total Marks by Gender or Age

In this Jupyter Notebook, we have learned about `groupby()` and `agg()` functions to split a dataframe into groups based on some criteria and compute some statistics (or aggregations) about each group.

We can use these functions to find the mean of total marks of respective Gender or Age. This can be useful in analyzing the performance of different groups in a dataset.

In [9]:
df.groupby('Age').agg({'Total' : 'mean'})

          Total
Age
13   214.687500
14   204.434783
15   210.208333

In [10]:
df.groupby('Gender').agg({'Total': 'mean'})

             Total
Gender
Female  209.340426
Male    211.812500

# Different Methods to Achieve the Same Result

In this Jupyter Notebook, we have learned about different methods to achieve the same result. For example, we can use `groupby()` and `agg()` functions to find the mean of total marks obtained by female students. Alternatively, we can use the `loc` function with the `==` operator and `mean()` function to get the same result. Again, wew can use groupby than directly using the `mean()` function to get the same result.

We have also learned about the `describe()` function in previous notebook, which is a general-purpose function that provides summary statistics for all numeric columns in a DataFrame. This function can be useful in analyzing the distribution of data in a dataset.

In [11]:
# same result using diffrent method which we learn before.
print(Female_gender_df["Total"].mean())
# also can use loc/ iloc method to get mean of total marks of Female
print(df.loc[df.Gender == 'Female', 'Total'].mean())

209.3404255319149
209.3404255319149

# **Pivot Tables**
- A pivot table is a way of summarizing data in a DataFrame for a particular purpose. It makes heavy use of the aggregation function. A pivot table is itself a DataFrame, where the rows represent one variable that you're interested in, the columns another, and the cell's some aggregate value. A pivot table also tends to include marginal values as well, which are the sums for each column and row. This allows you to be able to see the relationship between two variables at just a glance.

- The term pivot table itself is quite descriptive. In general computing terms a pivot is a mechanism to summarize data in a table. It's a concept found in all spreadsheet software packages, such as Excel or Google Sheets, and it's especially useful for exploring data. Pandas provides a function 'pivot_table' for this purpose. It takes a number of arguments, the first of which is the DataFrame that contains the data you want to pivot. Then, you have to specify the index (the rows), the columns, and then the actual values.

### Let's use Pivot Table in our data.

We can find average total mark of students in each Gender and Age group at a time.

In [12]:
# pivot table
df.pivot_table(index='Gender', columns='Age', values='Total', aggfunc='mean') # This showing average Total mark obtain by Female and male students in different age group.

Age             13          14          15
Gender
Female  211.166667  210.428571  206.133333
Male    219.214286  195.111111  217.000000

#### We can see two or more aggregates in same pivot table by using the list of aggregates

In [13]:
pd.pivot_table(df, index='Gender', columns='Age', values='Total', aggfunc=['mean', 'max'])

              mean                          max
Age             13          14          15   13   14   15
Gender
Female  211.166667  210.428571  206.133333  304  284  333
Male    219.214286  195.111111  217.000000  320  288  268

This showing all subject and their mean mark by Gender and Age Group

In [14]:
pivot_table10 = pd.pivot_table(df, index='Gender', columns='Age', values=['Science', 'English', 'History', 'Maths'], aggfunc='mean')
print(pivot_table10)

          English                          History                        \
Age            13         14         15         13         14         15
Gender
Female  49.388889  54.642857  51.200000  52.277778  50.785714  53.200000
Male    42.071429  36.444444  44.333333  64.357143  47.888889  47.777778

            Maths                     Science
Age            13    14         15         13         14         15
Gender
Female  60.500000  45.0  54.133333  49.000000  60.000000  47.600000
Male    55.357143  55.0  66.111111  57.428571  55.777778  58.777778

# **Melt function**
Melt function is used to transform wide data to long data. In other words, it transforms horizontal data to vertical data. It is used to reshape data.
- Melt function is used to transform or reshape data
- Syntax: pd.melt(dataframe, id_vars=[], var_name='', value_name='')
- id_vars: columns to be kept as it is
- var_name: other column name for variable column
- value_name: new column name for value of variable column

In [15]:
df_long = pd.melt(df, id_vars=['id', 'Name', 'Gender', 'Age'], var_name='Subject', value_name='Marks')

df_long.head()

   id      Name  Gender  Age  Subject  Marks
0   2    Lemmie    Male   15  Science     29
1   4     Denna  Female   14  Science     15
2   7   Ichabod  Female   14  Science     38
3   8  Beverlie    Male   14  Science     25
4  12   Valaria    Male   13  Science     19

In [16]:
df_long.tail()

      id      Name  Gender  Age Subject  Marks
390  243    Morrie  Female   13   Total    103
391  247       Rog  Female   13   Total    138
392  248      Kaia    Male   15   Total    267
393  249      Anni  Female   14   Total    233
394  250  Fernande    Male   15   Total    216

Here we can see that we keep id, Name, Gender, Age as it is. and convert rest columns into vertical format. and we put their values in the value column.

#### I think it hard to understand. But if you think some time you will get it. 
we simply leave some columns as it is and convert rest columns into vertical format. and we put their values in the value column.

#  Now we will learn about Stack and Unstack functions in Pandas

In [17]:
stacked_df = df.set_index(['id', 'Name', 'Gender', 'Age']).stack()
stacked_df

id   Name      Gender  Age
2    Lemmie    Male    15   Science     29
                            English     41
                            History     17
                            Maths       40
                            Total      127
                                      ...
250  Fernande  Male    15   Science     50
                            English      8
                            History     80
                            Maths       78
                            Total      216
Length: 395, dtype: int64

## Indexing and Stacking in Pandas
Here we use set_index() and stack() to manipulate our data.

We use set_index function to make few columns as index and also use the `stack()` function to convert the remaining columns into a series. This can be useful when we want to reshape our data from a wide format to a long format.

Overall, indexing and stacking are powerful tools that can help us to manipulate and analyze our data in a variety of ways.

In [18]:
df.set_index(['id', 'Name']).stack() # here only id and Name are index and rest are stacked

id   Name
2    Lemmie    Gender     Male
               Age          15
               Science      29
               English      41
               History      17
                          ...
250  Fernande  Science      50
               English       8
               History      80
               Maths        78
               Total       216
Length: 553, dtype: object

### We can also unstack the data frame to go back to the original format. If we only apply ```unstack()``` function on stacked_df it will go back to the original format. However, however, it will keep the index as we set it before unless we apply ```reset_index()``` function.

In [19]:
stacked_df.unstack().reset_index()

     id      Name  Gender  Age  Science  English  History  Maths  Total
0     2    Lemmie    Male   15       29       41       17     40    127
1     4     Denna  Female   14       15       53       82     33    183
2     7   Ichabod  Female   14       38       74       54     60    226
3     8  Beverlie    Male   14       25       51       41     80    197
4    12   Valaria    Male   13       19        5       78     76    178
..  ...       ...     ...  ...      ...      ...      ...    ...    ...
74  243    Morrie  Female   13       17       24       41     21    103
75  247       Rog  Female   13        1        4       68     65    138
76  248      Kaia    Male   15       93       48       82     44    267
77  249      Anni  Female   14       35       73       66     59    233
78  250  Fernande    Male   15       50        8       80     78    216

[79 rows x 9 columns]

## Use of Unstack() function
Unstack() function is used to convert the data into unstacked format. with help of this function we can reshape multi-index table. For example we have a table with two index columns and we want to convert it into single index column by taking one index column and convert it into column. This can be done with the help of unstack() function.

Unstack function is used to rearrange the data into more readable format.

In [20]:
df.head(3)

   id     Name  Gender  Age  Science  English  History  Maths  Total
0   2   Lemmie    Male   15       29       41       17     40    127
1   4    Denna  Female   14       15       53       82     33    183
2   7  Ichabod  Female   14       38       74       54     60    226

## To understand this function lets create a simple multi index dataframe from our existing dataframe

In [21]:
multi_index_df =df.groupby(['Gender', 'Age']).agg({'Total': 'mean'})
multi_index_df

                 Total
Gender Age
Female 13   211.166667
       14   210.428571
       15   206.133333
Male   13   219.214286
       14   195.111111
       15   217.000000

In [22]:
unstacked_df = multi_index_df.unstack('Age') # we can here write index name or index position such as unstack(0) inside parenthesis it will unstack that index. 
unstacked_df

             Total
Age             13          14          15
Gender
Female  211.166667  210.428571  206.133333
Male    219.214286  195.111111  217.000000

# Crosstab function
We can use the crosstab function to compute a cross-tabulation of two (or more) factors. The crosstab funciton is similar to the pivot_table function, but it aggregates the data using the len function by default. You can specify a different aggregation function using the aggfunc argument.

In [23]:
crosstab_df = pd.crosstab(df['Gender'],df['Age']) # first argument is the row, second argument is the column
crosstab_df

Age     13  14  15
Gender
Female  18  14  15
Male    14   9   9

### Also you can apply aggregation functions in the crosstab function. You have to declear value column and aggregation function in the crosstab function.

*You may ask so what is the difference between pivot and crosstab methods. Actually, they are very similar. The only difference is pivot method requires three parameters which are index, columns and values. In crosstab method, two parameters index and columns are mandatory but values parameter is optional. Also, crosstab method is more useful for aggregation functions.*

In [24]:
crosstab_df1 = pd.crosstab(df['Gender'], df['Age'], values=df['Total'], aggfunc='mean')
print(crosstab_df1)

Age             13          14          15
Gender
Female  211.166667  210.428571  206.133333
Male    219.214286  195.111111  217.000000

In the context of the Jupyter Notebook you are working on, the `crosstab()` function is used to find the relationship between Age and gender. The function takes two arguments: the row and column to be cross-tabulated. In this case, the row is the `Gender` column and the column is the `Age` column. The resulting table shows the count of each combination of gender and age.

You can also apply aggregation functions in the `crosstab()` function. You have to declare the value column and aggregation function in the `crosstab()` function. For example, you can find the mean of the `Total` column for each combination of gender and age by specifying `values=df['Total']` and `aggfunc='mean'`.

Overall, the `crosstab()` function is a useful tool for analyzing the relationship between two or more factors in a dataset.